Reports/ГрафикЗамеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ГрафикЗамеров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ИсторияЛида.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЛида</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьмаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписиВМобильномПриложении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_АдресФактическогоПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетЗамеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛичныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверятьПересечениеЗамеровВГрафике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортАдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифМонтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифыИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветМеткиЗамераНаКартеЯндекс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаМетокЯндексКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПраваПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПодписи</Name>
					<Comment>#4051</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВыполняемыхНормоЧасовМонтажаЗаЧасВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ГрафикЗамеров/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ Параметры.ДатаНачала = Дата("00010101") Тогда
	//	Отчет.ДатаНачала = Параметры.ДатаНачала;
	//Иначе 
	//	Отчет.ДатаНачала = ТекущаяДатаСеанса(); //НачалоНедели(ТекущаяДата());
	//КонецЕсли;

	//Если НЕ Параметры.ДатаОкончания = Дата("00010101") Тогда
	//	Отчет.ДатаОкончания = Параметры.ДатаОкончания;
	//Иначе
	//	Отчет.ДатаОкончания = ТекущаяДатаСеанса() + 86400*6; //КонецНедели(ТекущаяДата());
	//КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	МассивИсточников = Новый Массив;
	МассивИсточников.Добавить(Метаданные.Отчеты.ГрафикЗамеров);
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	//ПараметрыРазмещения.Источники = Новый ОписаниеТипов("ОтчетСсылка.ГрафикЗамеров");
	ПараметрыРазмещения.Источники = МассивИсточников;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп = ""; 	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Отчет.ДатаНачала 	= ТекущаяДатаСеанса(); //#8387
	Отчет.ДатаОкончания = ТекущаяДатаСеанса(); //#8387
	Элементы.УстановитьДень.Пометка = Истина;  //#8387
	
	// ВариантОтображенияГрафика	
	СписокВариантов = МодульОтчетов.ПолучитьСписокВариантовГрафикаЗамеров();
	ИспользоватьКартыЯндекс = НЕ ПустаяСтрока(Константы.КлючAPIЯндексКарты.Получить());
	// #15043 карту на отдельную вкладку
	//Если ИспользоватьКартыЯндекс Тогда
	//	СписокВариантов.Добавить(9, "Карты Яндекс");
	//КонецЕсли;
	Элементы.ГруппаКартыЯндекс.Видимость = ИспользоватьКартыЯндекс;
	
	Для каждого ТекЭлемент из СписокВариантов Цикл
		Элементы.Вариант.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
	КонецЦикла;
	
	ВариантОтображенияГрафикаНастройка = ХранилищеОбщихНастроек.Загрузить("ОтчетГрафикЗамеров", "ВариантОтображенияГрафика");
	//Вариант = ?(ВариантОтображенияГрафикаНастройка = Неопределено, 0, ВариантОтображенияГрафикаНастройка);	
	ВариантОтображенияГрафикаПоУмолчанию = Элементы.Вариант.СписокВыбора[0].Значение;
	Если ВариантОтображенияГрафикаНастройка = Неопределено Тогда
		Вариант = ВариантОтображенияГрафикаПоУмолчанию;
	ИначеЕсли Элементы.Вариант.СписокВыбора.НайтиПоЗначению(ВариантОтображенияГрафикаНастройка) = Неопределено Тогда
		Вариант = ВариантОтображенияГрафикаПоУмолчанию;
	Иначе
		Вариант = ВариантОтображенияГрафикаНастройка;
	КонецЕсли;	
	
	ОбновитьВидимостьЭлементов();

	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ФильтроватьГрафикЗамеровПоТочкеПродаж, ТочкаПродаж, ГородПоУмолчанию, РазрешеноРаспределениеПулаЗамеровНаЗамерщиков");
	
	Если РеквизитыПользователя.ФильтроватьГрафикЗамеровПоТочкеПродаж Тогда
		ФильтрТочкаПродаж = РеквизитыПользователя.ТочкаПродаж;
		
		//#6384
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ФильтрТочкаПродаж));
		Элементы.ФильтрТочкаПродаж.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	КонецЕсли;
	
	Элементы.ГруппаОписаниеЗамерщиков.Видимость = Ложь;	
	ОписаниеЗамерщиковHTML = Документы.Лид.СформироватьОписаниеЗамерщиковHTML(ФильтрТочкаПродаж);
	
	//#11453
	НастройкаОформленияГрафикаЗамеров = ОбщийМодульСервер.ПолучитьНастройкуОформленияГрафикаЗамеров(); 
	НастройкиОформленияГрафикаЗамеров = ОбщийМодульСервер.ПолучитьНастройкиОформленияГрафикаЗамеров(НастройкаОформленияГрафикаЗамеров);
	ОбщийМодульСервер.ЗаполнитьГруппуГрафикЗамеровОформление(ЭтаФорма, НастройкиОформленияГрафикаЗамеров, Элементы.ГруппаГрафикОформлениеЗамеры, Элементы.ГруппаГрафикОформлениеВыезды);
	
	ВремяНачалаЗамеров = Константы.НачалоРабочегоВремениЗамеров.Получить();
	ВремяКонцаЗамеров = Константы.КонецРабочегоВремениЗамеров.Получить();
	
	ПродолжительностьЗамера = Константы.КоличествоЧасовНеобходимыхНаЗамер.Получить();
	ПродолжительностьЗамера = ?(ПродолжительностьЗамера = 0, 0.5, ПродолжительностьЗамера);
	
	Город = РеквизитыПользователя.ГородПоУмолчанию;
	Если Город.Пустая() Тогда
		Город = Константы.ГородПоУмолчанию.Получить();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РежимСовместимости = ХранилищеОбщихНастроек.Загрузить("ЯндексКарты_РежимСовместимости");
	УстановитьПривилегированныйРежим(Ложь);
	
	СохранитьЗначенияНастроекОтчета();	
	
	//Элементы.КнопкаПревышенПлан.Видимость  = ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров");
	//Элементы.НадписьПревышенПлан.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров");
	
 	РазрешеноРаспределениеПулаЗамеровНаЗамерщиков = РеквизитыПользователя.РазрешеноРаспределениеПулаЗамеровНаЗамерщиков;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		//назначили новый замер по новому лиду
		Если ВыбранноеЗначение.Свойство("ВыборНового") Тогда
		    Сформировать(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//#5402
	ПодключитьОбработчикОжидания("СформироватьПриЗапуске", 0.1, Истина);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СформироватьПриЗапуске()
	Сформировать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКартыЯндекс Тогда		
		ИнициализироватьКартуЯндекс();
	КонецЕсли;
	
	Элементы.ДекорацияНетОтчета.Видимость = Ложь;	
	
	РезультатПланировщик.ШкалаВремени.ЦветФона = WebЦвета.Белый;
	
	Если Вариант = 0 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		Элементы.ГруппаРезультатТаблица.Видимость = Ложь;
		СформироватьГрафикЗамеровКалендарьНаСервере(0);	
		
	ИначеЕсли Вариант = 1 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		Элементы.ГруппаРезультатТаблица.Видимость = Ложь;
		СформироватьГрафикЗамеровКалендарьНаСервере(1);
		
	// пул
	ИначеЕсли Вариант = 5 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		Элементы.ГруппаРезультатТаблица.Видимость = Ложь;
		СформироватьГрафикПоПлануКалендарьНаСервере(0, Ложь);	
		
	ИначеЕсли Вариант = 6 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		Элементы.ГруппаРезультатТаблица.Видимость = Ложь;
		СформироватьГрафикПоПлануКалендарьНаСервере(1, Ложь);
		
	// распределение монтажей
	ИначеЕсли Вариант = 3 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		Элементы.ГруппаРезультатТаблица.Видимость = Ложь;
		СформироватьГрафикПоПлануКалендарьНаСервере(0, Истина);	
		
	ИначеЕсли Вариант = 4 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Истина;
		Элементы.ГруппаРезультатТаблица.Видимость = Ложь;
		СформироватьГрафикПоПлануКалендарьНаСервере(1, Истина);
		
	// табличный документ
	ИначеЕсли Вариант = 2 Тогда
		Элементы.ГруппаРезультатПланировщик.Видимость = Ложь;
		Элементы.ГруппаРезультатТаблица.Видимость = Истина;
		РезультатТаблица = СформироватьГрафикЗамеровТаблица();
		
	//ИначеЕсли Вариант = 9 Тогда
		//карты Яндекс
	//	ИнициализироватьКартуЯндекс();
	КонецЕсли; 
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
	СформироватьОписанияЗамерщиковHTML();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКартуЯндекс()
	
	КартаЯндекс = КартыЯндекс.ИнициализироватьКарту(Город,Отчет.ДатаНачала, РежимСовместимости);
	ЛегендаЯндекс = КартыЯндекс.СформироватьЛегендуЯндексКарт(ФильтрТочкаПродаж);
	
КонецПроцедуры

&НаСервере
Функция СформироватьГрафикЗамеровТаблица()
	
	Возврат МодульОтчетов.СформироватьГрафикЗамеровТаблица(Отчет.ДатаНачала, Отчет.ДатаОкончания, ФильтрТочкаПродаж);
	
КонецФункции

&НаСервере
Процедура СформироватьГрафикЗамеровКалендарьНаСервере(Развертка)
	
	МодульОтчетов.СформироватьГрафикЗамеровПоЗамерщикамКалендарь(РезультатПланировщик, Отчет.ДатаНачала, Отчет.ДатаОкончания, Развертка, ФильтрТочкаПродаж);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьГрафикПоПлануКалендарьНаСервере(Развертка, ВыводитьРеальныхЗамерщиков)
	
	МодульОтчетов.СформироватьГрафикЗамеровПоПлануКалендарь(РезультатПланировщик, Отчет.ДатаНачала, Отчет.ДатаОкончания, Развертка, ВыводитьРеальныхЗамерщиков, ФильтрТочкаПродаж);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДень(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.УстановитьПериодГрафикаДень(ЭтотОбъект, ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНеделя(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.УстановитьПериодГрафикаНеделя(ЭтотОбъект, ОписаниеОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМесяц(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.УстановитьПериодГрафикаМесяц(ЭтотОбъект, ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКартыЯндекс Тогда
				
		Элементы.ДатаНачала.Заголовок = "Дата";
		Элементы.ДатаОкончания.Видимость = Ложь;
		Элементы.УстановитьДень.Видимость = Ложь;
		Элементы.УстановитьМесяц.Видимость = Ложь;
		Элементы.УстановитьНеделя.Видимость = Ложь;
		Элементы.ДекорацияТиреИнтервала.Видимость = Ложь;
		Элементы.ВыбратьПериод.Видимость = Ложь;		
	
	Иначе
		
		Если Вариант = 2 Тогда
			Элементы.ДекорацияНетОтчета.Видимость = Ложь;
			Элементы.ГруппаРезультатПланировщик.Видимость = Ложь;
			Элементы.ГруппаРезультатТаблица.Видимость = Истина;
			//Элементы.ГруппаКартыЯндекс.Видимость = Ложь;
			Элементы.ГруппаГрафикОформление.Видимость = Истина;
			Элементы.ДатаНачала.Заголовок = "Интервал";
			Элементы.ДатаОкончания.Видимость = Истина;
			Элементы.УстановитьДень.Видимость = Истина;
			Элементы.УстановитьМесяц.Видимость = Истина;
			Элементы.УстановитьНеделя.Видимость = Истина;
			Элементы.ДекорацияТиреИнтервала.Видимость = Истина;		
		//ИначеЕсли Вариант = 9 Тогда
			//	//карты Яндекс
			//	Элементы.ДекорацияНетОтчета.Видимость = Ложь;
			//	Элементы.ГруппаРезультатПланировщик.Видимость = Ложь;
			//	Элементы.ГруппаРезультатТаблица.Видимость = Ложь;
			//	Элементы.ГруппаКартыЯндекс.Видимость = Истина;
			//	Элементы.ГруппаГрафикОформление.Видимость = Ложь;
			//	Элементы.ДатаНачала.Заголовок = "Дата";
			//	Элементы.ДатаОкончания.Видимость = Ложь;
			//	Элементы.УстановитьДень.Видимость = Ложь;
			//	Элементы.УстановитьМесяц.Видимость = Ложь;
			//	Элементы.УстановитьНеделя.Видимость = Ложь;
			//	Элементы.ДекорацияТиреИнтервала.Видимость = Ложь;
			
		Иначе
			Элементы.ДекорацияНетОтчета.Видимость = Истина;
			Элементы.ГруппаРезультатПланировщик.Видимость = Ложь;
			Элементы.ГруппаРезультатТаблица.Видимость = Ложь;
			//Элементы.ГруппаКартыЯндекс.Видимость = Ложь;
			Элементы.ГруппаГрафикОформление.Видимость = Истина;
			Элементы.ДатаНачала.Заголовок = "Интервал";
			Элементы.ДатаОкончания.Видимость = Истина;
			Элементы.УстановитьДень.Видимость = Истина;
			Элементы.УстановитьМесяц.Видимость = Истина;
			Элементы.УстановитьНеделя.Видимость = Истина;
			Элементы.ДекорацияТиреИнтервала.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	//Элементы.РежимСовместимости.Видимость = (Вариант = 9);
	
КонецПроцедуры
		
&НаКлиенте
Процедура ВариантПриИзменении(Элемент)
	
	//Если Вариант = 9 Тогда
	//	//карты Яндекс
	//	Отчет.ДатаОкончания = Отчет.ДатаНачала;    						//#8387
	//	ОбщийМодульКлиент.СнятьПометкиКнопокИнтервалаГрафика(Элементы); //#8387
	//	Элементы.УстановитьДень.Пометка = Истина;  						//#8387
	//КонецЕсли;

	ВариантОтображенияГрафикаПриИзмененииНаСервере();
	ОбновитьВидимостьЭлементов();
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ВариантОтображенияГрафикаПриИзмененииНаСервере()
	ХранилищеОбщихНастроек.Сохранить("ОтчетГрафикЗамеров", "ВариантОтображенияГрафика", Вариант);
КонецПроцедуры

&НаКлиенте
Процедура ДатаИнтервалаПриИзменении()

	СохранитьЗначенияНастроекОтчета();
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПриИзмененииДатыНачалаГрафика(ЭтотОбъект);
	ДатаИнтервалаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ОбщийМодульКлиент.ПриИзмененииДатыОкончанияГрафика(ЭтотОбъект);
	ДатаИнтервалаПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияНастроекОтчета()
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ОтчётГрафикЗамеров_Настройки",, новый Структура("ДатаНачала, ДатаОкончания", Отчет.ДатаНачала, Отчет.ДатаОкончания));	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТочкаПродажПриИзменении(Элемент)
	Сформировать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура РежимСовместимостиПриИзменении(Элемент)
	
	РежимСовместимостиПриИзмененииНаСервере();
	//Сформировать(Неопределено);
	ИнициализироватьКартуЯндекс();
	
КонецПроцедуры

&НаСервере
Процедура РежимСовместимостиПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ЯндексКарты_РежимСовместимости",, РежимСовместимости);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ОписаниеОповещенияПослеВыбораПериода = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьДиалогВыбораПериода(ЭтотОбъект, ОписаниеОповещенияПослеВыбораПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДатИнтервала(Результат, ДополнительныеПараметры) Экспорт
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКартыЯндекс Тогда
		Отчет.ДатаОкончания = Отчет.ДатаНачала;
	КонецЕсли;
	ДатаИнтервалаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьИнтервалВлево(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.СдвинутьДатуГрафика(ЭтотОбъект, -1, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьИнтервалВправо(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииДатИнтервала", ЭтотОбъект);
	ОбщийМодульКлиент.СдвинутьДатуГрафика(ЭтотОбъект, 1, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКартыЯндекс Тогда
		Отчет.ДатаОкончания = Отчет.ДатаНачала;    						//#8387
		ОбщийМодульКлиент.СнятьПометкиКнопокИнтервалаГрафика(Элементы); //#8387
		Элементы.УстановитьДень.Пометка = Истина;  						//#8387
		
		ИнициализироватьКартуЯндекс();
	КонецЕсли;

	ВариантОтображенияГрафикаПриИзмененииНаСервере();
	ОбновитьВидимостьЭлементов();
	Сформировать(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура ОткрытьФормуНовогоЛида(Расшифровка)
	//Структура("ДатаЗамера,ВремяНачалаЗамера,ВремяОкончанияЗамера,ИсполнительЗамера"
	
	//Если НЕ Вариант = 3 И НЕ Вариант = 4 Тогда
		Если НЕ ПроверитьСвободныйИнтервалЗамеров(Расшифровка) Тогда
			ОчиститьСообщения();
			Сообщить("Выбранный интервал занят");
			Сформировать(Неопределено); // #9710 пересечение есть, но на визуальном графике этого возможно еще не видно
			Возврат;
		КонецЕсли;
	//КонецЕсли;

	ПараметрыОснования = Расшифровка;
	ПараметрыОснования.Вставить("ЗаявкаНаЗамер", Истина);
	
	ПараметрыФормы = Новый Структура("Основание, ВыборНового", ПараметрыОснования, Истина);
	ОткрытьФорму("Документ.Лид.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, Новый УникальныйИдентификатор);
	// получение результата в процедуре ОбработкаВыбора
КонецПроцедуры

&НаСервере
Функция ПроверитьСвободныйИнтервалЗамеров(Знач ПараметрыНовогоЗамера)
	
	Если НЕ ПараметрыНовогоЗамера.Свойство("ИдЗамера") Тогда
		ПараметрыНовогоЗамера.Вставить("ИдЗамера", "");
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ИдЗамера") Тогда
		ПараметрыНовогоЗамера.Вставить("ИдЗамера", "");
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ИсполнительЗамера") И ПараметрыНовогоЗамера.Свойство("Исполнитель") Тогда
		ПараметрыНовогоЗамера.Вставить("ИсполнительЗамера", ПараметрыНовогоЗамера.Исполнитель);
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ДатаЗамера") И ПараметрыНовогоЗамера.Свойство("Дата") Тогда
		ПараметрыНовогоЗамера.Вставить("ДатаЗамера", ПараметрыНовогоЗамера.Дата);
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ВремяНачала") И ПараметрыНовогоЗамера.Свойство("ВремяНачалаЗамера") Тогда
		ПараметрыНовогоЗамера.Вставить("ВремяНачала", ПараметрыНовогоЗамера.ВремяНачалаЗамера);
	КонецЕсли;
	Если НЕ ПараметрыНовогоЗамера.Свойство("ВремяОкончания") И ПараметрыНовогоЗамера.Свойство("ВремяОкончанияЗамера") Тогда
		ПараметрыНовогоЗамера.Вставить("ВремяОкончания", ПараметрыНовогоЗамера.ВремяОкончанияЗамера);
	КонецЕсли;
	Возврат МодульОтчетов.ПроверитьСвободныйИнтервалЗамеров(ПараметрыНовогоЗамера, ФильтрТочкаПродаж);
	
	//Если ТипЗнч(ПараметрыНовогоЗамера.ИсполнительЗамера) = Тип("СправочникСсылка.Сотрудники") Тогда
	//	Если НЕ ПараметрыНовогоЗамера.ИсполнительЗамера.НеПроверятьПересечениеЗамеровВГрафике 
	//		И НЕ ОбщийМодуль.ПроверитьСвободныйИнтервалЗамеров(ПараметрыНовогоЗамера.ДатаЗамера, ПараметрыНовогоЗамера.ИсполнительЗамера, ПараметрыНовогоЗамера.ВремяНачалаЗамера, ПараметрыНовогоЗамера.ВремяОкончанияЗамера, Лид) Тогда
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если ПолучитьФункциональнуюОпцию("ИспользоватьПулЗамеров") 
	//	И (ТипЗнч(ПараметрыНовогоЗамера.ИсполнительЗамера) = Тип("Строка") // строка вида "ПланируемыйХХХ"
	//	ИЛИ Вариант = 3 ИЛИ Вариант = 4 
	//	ИЛИ Вариант = 0 ИЛИ Вариант = 1) Тогда // используется вариант Календарь, но есть замеры по "пулу"
	//	КоличествоУникальныхЗамеров = МодульОтчетов.ПолучитьКоличествоЗамеровВИнтервале(ПараметрыНовогоЗамера.ДатаЗамера, ПараметрыНовогоЗамера.ВремяНачалаЗамера, ПараметрыНовогоЗамера.ВремяОкончанияЗамера, ФильтрТочкаПродаж, Лид, Ложь);
	//	КоличествоЗамерщиковПоПлану = МодульОтчетов.ПолучитьКоличествоЗамерщиковПоПлану(ПараметрыНовогоЗамера.ВремяНачалаЗамера, ПараметрыНовогоЗамера.ВремяОкончанияЗамера, ФильтрТочкаПродаж);
	//	Если КоличествоУникальныхЗамеров >= КоличествоЗамерщиковПоПлану Тогда
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ВариантПланировщик

&НаКлиенте
Процедура РезультатПланировщикПриАктивизации(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикВыбор(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не Элементы.РезультатПланировщик.ВыделенныеЭлементы.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныйЭлемент = Элементы.РезультатПланировщик.ВыделенныеЭлементы[0];
	ДокументРегистратор = ВыделенныйЭлемент.Значение.Регистратор;
		
	Если Не ЗначениеЗаполнено(ДокументРегистратор) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ДокументРегистратор);
	
	//Если ТипЗнч(ДокументРегистратор) = Тип("ДокументСсылка.Замер") Тогда
	//	ОткрытьФорму("Документ.Замер.ФормаОбъекта", ПараметрыФормы);
	//Иначе
	Если ТипЗнч(ДокументРегистратор) = Тип("ДокументСсылка.Лид") Тогда
		ОткрытьФорму("Документ.Лид.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, Значения)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОснования = Новый Структура;
	ПараметрыОснования.Вставить("ДатаЗамера", 			НачалоДня(Начало));
	ПараметрыОснования.Вставить("ВремяНачалаЗамера", 	Дата("00010101") + (Начало - НачалоДня(Начало)));
	ПараметрыОснования.Вставить("ВремяОкончанияЗамера", Дата("00010101") + (Конец - НачалоДня(Конец)));
	ПараметрыОснования.Вставить("ИсполнительЗамера", 	Значения.Получить("Сотрудник"));
 	ОткрытьФормуНовогоЛида(ПараметрыОснования);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ЭлементЗамера = Элемент.ВыделенныеЭлементы[0];
	
	// в графике по пулу - перенос замеров, назначенных на реальных замерщиков
	ТекстВопросаДополнение = "";
	НовыйИсполнительЗамера = ЭлементЗамера.ЗначенияИзмерений["Сотрудник"];
	Если (Вариант = 3 ИЛИ Вариант = 4) И ЭлементЗамера.Значение.НазначенНаЗамерщика И НЕ РазрешеноРаспределениеПулаЗамеровНаЗамерщиков Тогда
		ТекстВопросаДополнение = "Исполнитель замера будет сброшен. ";
		НовыйИсполнительЗамера = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	//	ОтменаРедактирования = Истина;
	//	Возврат;
	КонецЕсли;
	// запрещаем перенос невыходов
	Если ТипЗнч(ЭлементЗамера.Значение.Регистратор) = Тип("ДокументСсылка.УДАЛИТЬ_Невыходы") 
		ИЛИ ТипЗнч(ЭлементЗамера.Значение.Регистратор) = Тип("ДокументСсылка.ГрафикРаботыЗамерщиков") Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;
	// запрещаем перенос выполненных замеров/выездов
	Если ЭлементЗамера.Значение.Выполнен Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтоВыезд = ЭлементЗамера.Значение.ЭтоВыезд;
	ДополнительныеПараметры.Вставить("Начало", ЭлементЗамера.Начало);
	ДополнительныеПараметры.Вставить("Конец",  ЭлементЗамера.Конец);
	ДополнительныеПараметры.Вставить("Регистратор", ЭлементЗамера.Значение.Регистратор);
	ДополнительныеПараметры.Вставить("ИДЗамера",	ЭлементЗамера.Значение.ИДЗамера);
	ДополнительныеПараметры.Вставить("ЭтоВыезд", 	ЭтоВыезд);	
	ДополнительныеПараметры.Вставить("Сотрудник", 	НовыйИсполнительЗамера);
	
	ПослеСдвигаЗамера = Новый ОписаниеОповещения("ПослеСдвигаЗамера", ЭтаФорма, ДополнительныеПараметры);
	ПоказатьВопрос(ПослеСдвигаЗамера, ТекстВопросаДополнение + "Сохранить изменения " + ?(НЕ ЭтоВыезд, "замера", "выезда") + "?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСдвигаЗамера(Результат, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	Если Результат = КодВозвратаДиалога.Нет Тогда
		//отказались от сохранения результата. Перестроим отчет
        Сформировать(Неопределено);
		Возврат;
	КонецЕсли;
	
	Если ПослеСдвигаЗамераНаСервере(ДополнительныеПараметры) Тогда
		// #12209
		РаботаССМСКлиент.ПослеЗаписиЛида(ДополнительныеПараметры.Регистратор);		
	КонецЕсли;
	Сформировать(Неопределено);
	
	//++ №12180 заглушка для платформы 8.3.18.1208, чтобы после переноса, фокус скидывался
	Для Каждого ТекЭлемент Из РезультатПланировщик.Элементы Цикл
		ЦветФонаБыл = ТекЭлемент.ЦветФона;
		ТекЭлемент.ЦветФона = WebЦвета.Белоснежный;
		ТекЭлемент.ЦветФона = ЦветФонаБыл;
	КонецЦикла;
	//-- №12180

КонецПроцедуры

&НаСервере
Функция ПослеСдвигаЗамераНаСервере(ПараметрыЗамера)
	
	ЛидСсылка = ПараметрыЗамера.Регистратор;
	Если ТипЗнч(ЛидСсылка) <> Тип("ДокументСсылка.Лид") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ПараметрыЗамера.ЭтоВыезд Тогда
		НайденныеСтроки = ЛидСсылка.Замеры.НайтиСтроки(Новый Структура("ИДЗамера", ПараметрыЗамера.ИДЗамера));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ДанныеЗамера = НайденныеСтроки[0];
			Если ДанныеЗамера.ДатаЗамера + (ДанныеЗамера.ВремяНачалаЗамера - Дата(1, 1, 1)) = ПараметрыЗамера.Начало
				И ДанныеЗамера.ДатаЗамера + (ДанныеЗамера.ВремяОкончанияЗамера - Дата(1, 1, 1)) = ПараметрыЗамера.Конец
				И (ДанныеЗамера.ИсполнительЗамера = ПараметрыЗамера.Сотрудник
			   		ИЛИ (ДанныеЗамера.ИсполнительЗамера = Справочники.Сотрудники.ПустаяСсылка() //#6384
			        	И ТипЗнч(ПараметрыЗамера.Сотрудник) = Тип("Строка")))
			Тогда
				//ничего не поменялось в замере
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		НайденныеСтроки = ЛидСсылка.Выезды.НайтиСтроки(Новый Структура("ИДЗамера", ПараметрыЗамера.ИДЗамера));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ДанныеВыезда = НайденныеСтроки[0];
			Если (ДанныеВыезда.Дата + (ДанныеВыезда.ВремяНачала - Дата(1, 1, 1))) = ПараметрыЗамера.Начало
				И (ДанныеВыезда.Дата + (ДанныеВыезда.ВремяОкончания - Дата(1, 1, 1))) = ПараметрыЗамера.Конец
				И (ДанныеВыезда.Исполнитель = ПараметрыЗамера.Сотрудник
			   		ИЛИ (ДанныеВыезда.Исполнитель = Справочники.Сотрудники.ПустаяСсылка()      //#6384
			        	И ТипЗнч(ПараметрыЗамера.Сотрудник) = Тип("Строка")))
			Тогда	
				//ничего не поменялось в выезде
				Возврат Ложь;
			КонецЕсли;			
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;			
		
	//пытаемся изменить документ лид
	РезультатЗаписиЛида = ОбновитьЛидНаСервере(ЛидСсылка, 
							ПараметрыЗамера.Сотрудник, 
							Дата(Год(ПараметрыЗамера.Начало),Месяц(ПараметрыЗамера.Начало), День(ПараметрыЗамера.Начало)), 
							Дата(1,1,1,Час(ПараметрыЗамера.Начало), Минута(ПараметрыЗамера.Начало), Секунда(ПараметрыЗамера.Начало)), 
							Дата(1,1,1,Час(ПараметрыЗамера.Конец), Минута(ПараметрыЗамера.Конец), Секунда(ПараметрыЗамера.Конец)), 
							ПараметрыЗамера.ЭтоВыезд,
							ПараметрыЗамера.ИДЗамера);
							
	Возврат РезультатЗаписиЛида;						
	
	//Для Каждого ТекущийЗамер Из РезультатПланировщик.Элементы Цикл
	//	ЛидСсылка = ТекущийЗамер.Значение.Регистратор;
	//	Если ТипЗнч(ЛидСсылка) <> Тип("ДокументСсылка.Лид") Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	ЭтоВыезд = ТекущийЗамер.Значение.ЭтоВыезд; //СтрНайти(ВРег(ТекущийЗамер.Текст), "ВЫЕЗД:") <> 0;
	//	Если НЕ ЭтоВыезд 
	//		И (ЛидСсылка.ПоследняяДатаЗамера + (ЛидСсылка.ПоследнееВремяНачалаЗамера - Дата(1, 1, 1))) = ТекущийЗамер.Начало
	//		И (ЛидСсылка.ПоследняяДатаЗамера + (ЛидСсылка.ПоследнееВремяОкончанияЗамера - Дата(1, 1, 1))) = ТекущийЗамер.Конец
	//		И (ЛидСсылка.ПоследнийИсполнительЗамера = ТекущийЗамер.ЗначенияИзмерений["Сотрудник"]
	//		   ИЛИ (ЛидСсылка.ПоследнийИсполнительЗамера = Справочники.Сотрудники.ПустаяСсылка() //#6384
	//		        И ТипЗнч(ТекущийЗамер.ЗначенияИзмерений["Сотрудник"]) = Тип("Строка")))
	//	Тогда
	//		//ничего не поменялось в замере
	//		Продолжить;
	//	ИначеЕсли ЭтоВыезд Тогда
	//		ДанныеВыезда = ЛидСсылка.Выезды[ЛидСсылка.Выезды.Количество()-1];
	//		Если (ДанныеВыезда.Дата + (ДанныеВыезда.ВремяНачала - Дата(1, 1, 1))) = ТекущийЗамер.Начало
	//			И (ДанныеВыезда.Дата + (ДанныеВыезда.ВремяОкончания - Дата(1, 1, 1))) = ТекущийЗамер.Конец
	//			И (ДанныеВыезда.Исполнитель = ТекущийЗамер.ЗначенияИзмерений["Сотрудник"]
	//		   		ИЛИ (ДанныеВыезда.Исполнитель = Справочники.Сотрудники.ПустаяСсылка()      //#6384
	//		        	И ТипЗнч(ТекущийЗамер.ЗначенияИзмерений["Сотрудник"]) = Тип("Строка")))
	//		Тогда	
	//			//ничего не поменялось в выезде
	//			Продолжить;
	//		КонецЕсли;
	//	КонецЕсли;			
	//	
	//	//пытаемся изменить документ лид
	//	ОбновитьЛидНаСервере(ЛидСсылка, 
	//						ТекущийЗамер.ЗначенияИзмерений["Сотрудник"], 
	//						Дата(Год(ТекущийЗамер.Начало),Месяц(ТекущийЗамер.Начало), День(ТекущийЗамер.Начало)), 
	//						Дата(1,1,1,Час(ТекущийЗамер.Начало), Минута(ТекущийЗамер.Начало), Секунда(ТекущийЗамер.Начало)), 
	//						Дата(1,1,1,Час(ТекущийЗамер.Конец), Минута(ТекущийЗамер.Конец), Секунда(ТекущийЗамер.Конец)), ЭтоВыезд);	
	//	
	//КонецЦикла;
	
КонецФункции

&НаСервере
Функция ОбновитьЛидНаСервере(ЛидСсылка, Сотрудник, НоваяДатаЗамера, НовоеВремяНачалаЗамера, НовоеВремяОкончанияЗамера, ЭтоВыезд, ИДЗамера)
	
	ПараметрыЗамера = Новый Структура;
	ПараметрыЗамера.Вставить("ДатаЗамера", НоваяДатаЗамера);
	ПараметрыЗамера.Вставить("ИсполнительЗамера", Сотрудник); 
	ПараметрыЗамера.Вставить("ВремяНачалаЗамера", НовоеВремяНачалаЗамера);
	ПараметрыЗамера.Вставить("ВремяОкончанияЗамера", НовоеВремяОкончанияЗамера);
	ПараметрыЗамера.Вставить("ИДЗамера", ИДЗамера);

	Если НЕ ПроверитьСвободныйИнтервалЗамеров(ПараметрыЗамера) Тогда
		Сообщить("Выбранный интервал занят");
		Возврат Ложь;
	КонецЕсли;
	
	ДокОбъект = ЛидСсылка.ПолучитьОбъект();
	
	Если НЕ ЭтоВыезд Тогда
		//Замер
		НайденныеСтроки = ДокОбъект.Замеры.НайтиСтроки(Новый Структура("ИДЗамера", ИДЗамера));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ДанныеЗамера = НайденныеСтроки[0];
			ДанныеЗамера.ИсполнительЗамера = ?(ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники"), Сотрудник, Справочники.Сотрудники.ПустаяСсылка());
			ДанныеЗамера.ДатаЗамера = НоваяДатаЗамера;
			ДанныеЗамера.ВремяНачалаЗамера = НовоеВремяНачалаЗамера;
			ДанныеЗамера.ВремяОкончанияЗамера = НовоеВремяОкончанияЗамера;
			
			Если ДанныеЗамера.НомерСтроки = ДокОбъект.Замеры.Количество() Тогда				
				ДокОбъект.ПоследнийИсполнительЗамера = ДанныеЗамера.ИсполнительЗамера;
				ДокОбъект.ПоследняяДатаЗамера = НоваяДатаЗамера;
				ДокОбъект.ПоследнееВремяНачалаЗамера = НовоеВремяНачалаЗамера;
				ДокОбъект.ПоследнееВремяОкончанияЗамера = НовоеВремяОкончанияЗамера;
			КонецЕсли;
		КонецЕсли;
	Иначе	
		//Выезд
		НайденныеСтроки = ДокОбъект.Выезды.НайтиСтроки(Новый Структура("ИДЗамера", ИДЗамера));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ДанныеВыезда = НайденныеСтроки[0];
			ДанныеВыезда.Исполнитель = ?(ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники"), Сотрудник, Справочники.Сотрудники.ПустаяСсылка());
			ДанныеВыезда.Дата = НоваяДатаЗамера;
			ДанныеВыезда.ВремяНачала = НовоеВремяНачалаЗамера;
			ДанныеВыезда.ВремяОкончания = НовоеВремяОкончанияЗамера;
		КонецЕсли;
	КонецЕсли;	
	
	// #11632 закомментировано
	//ДокОбъект.ДатаПоследнейРеакции = ТекущаяДатаСеанса();
	
	Комментарий = "Изменено расписание " + ?(ЭтоВыезд, "выезда", "замера") + " из графика замеров. Новые значения: " + Формат(НоваяДатаЗамера, "ДЛФ=Д") + " " + Формат(НовоеВремяНачалаЗамера, "ДЛФ=В") + "-" + Формат(НовоеВремяОкончанияЗамера, "ДЛФ=В") + ". Замерщик: " + Сотрудник;
	ДокОбъект.ПоследнийКомментарий = Комментарий;		
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		РегистрыСведений.ИсторияЛида.ДобавитьЗаписьВИсториюЛида(ДокОбъект.Ссылка, ТекущаяДатаСеанса(), Пользователи.ТекущийПользователь(), Новый УникальныйИдентификатор, Комментарий);
		
		// №12181
		ОтправитьПУШУведомленияНаСервере(Сотрудник, НоваяДатаЗамера, НовоеВремяНачалаЗамера, НовоеВремяОкончанияЗамера, ЭтоВыезд, ?(ЭтоВыезд И ДокОбъект.АдресВыездаОтличаетсяОтАдресаЛида, ДокОбъект.АдресВыезда, ДокОбъект.Адрес));
		Возврат Истина;
	Исключение
		Сообщить("Не удалось изменить " + ЛидСсылка + ". Ошибка: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОтправитьПУШУведомленияНаСервере(Сотрудник, НоваяДатаЗамера, НовоеВремяНачалаЗамера, НовоеВремяОкончанияЗамера, ЭтоВыезд, Адрес)
	
	МассивДанных = Новый Массив;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Текст", "Новая дата: " + Формат(НоваяДатаЗамера, "ДФ=dd.MM.yyyy") + " г. " + Формат(НовоеВремяНачалаЗамера, "ДФ=ЧЧ:мм") + "-" + Формат(НовоеВремяОкончанияЗамера, "ДФ=ЧЧ:мм") + " Адрес: " + Адрес);
	СтруктураДанных.Вставить("Исполнитель", Сотрудник);
	СтруктураДанных.Вставить("Заголовок", ?(ЭтоВыезд, "Выезд", "Замер") + " перенесен");
	
	МассивДанных.Добавить(СтруктураДанных);
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка PUSH уведомлений замерщикам'");
	Результат = ДлительныеОперации.ВыполнитьВФоне("МобильныйКлиент.ОтправитьPUSHУведомлениеОбИзмененияхЗамеров", МассивДанных, ПараметрыВыполнения);
		
КонецПроцедуры

&НаКлиенте
Процедура РезультатПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	// например при прокрутке ролика мыши
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЗамерщиковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОписаниеЗамерщиков.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", новый Структура("Ключ", ТекущиеДанные.Замерщик), ЭтотОбъект);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ВариантТаблица

&НаКлиенте
Процедура РезультатТаблицаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	//++ не срабатывает в режиме Редактирования, включенного для возможности перетаскивания
	//перенесено в событие Выбор	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если Расшифровка.Свойство("МассивДокументов") Тогда
			//передан массив документов
			Для Каждого ЭлементМассива Из Расшифровка.МассивДокументов Цикл				
				ПоказатьЗначение(,ЭлементМассива.Регистратор);								
			КонецЦикла;	
		Иначе
			ОткрытьФормуНовогоЛида(Расшифровка);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РезультатТаблицаВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Расшифровка = Область.Расшифровка;
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если Расшифровка.Свойство("МассивДокументов") Тогда
			//передан массив документов
			Для Каждого ЭлементМассива Из Расшифровка.МассивДокументов Цикл				
				ПоказатьЗначение(,ЭлементМассива.Регистратор);									
			КонецЦикла;	
		Иначе
			ОткрытьФормуНовогоЛида(Расшифровка);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатТаблицаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	СтароеЗначение = ПараметрыПеретаскивания.Значение.ТекущаяОбласть.Расшифровка;
	Если СтароеЗначение = Неопределено Тогда
		Выполнение = Ложь;
	Иначе
		Если НЕ СтароеЗначение.Свойство("МассивДокументов") Тогда
			Выполнение = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатТаблицаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	
	// перетащили 
	СтароеЗначение = ПараметрыПеретаскивания.Значение.ТекущаяОбласть.Расшифровка;
	НовоеЗначение  = Область.Расшифровка;
	Если НовоеЗначение <> Неопределено Тогда
		// если есть изменения
		Если СтароеЗначение.ДатаЗамера <> НовоеЗначение.ДатаЗамера 
			ИЛИ СтароеЗначение.ВремяНачалаЗамера <> НовоеЗначение.ВремяНачалаЗамера 
			ИЛИ СтароеЗначение.ВремяОкончанияЗамера <> НовоеЗначение.ВремяОкончанияЗамера
			ИЛИ СтароеЗначение.ИсполнительЗамера <> НовоеЗначение.ИсполнительЗамера Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("НовоеЗначение",  НовоеЗначение);
			ДопПараметры.Вставить("СтароеЗначение", СтароеЗначение);
			ПослеСдвигаЗамера = Новый ОписаниеОповещения("ПослеСдвигаЗамераТаблица", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ПослеСдвигаЗамера, "Сохранить изменения замера?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	Иначе
		СтандартнаяОбработка = Ложь;
		Сформировать(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСдвигаЗамераТаблица(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Сформировать(Неопределено);
		Возврат;
	КонецЕсли;
	
	ПослеСдвигаЗамераТаблицаНаСервере(ДопПараметры.НовоеЗначение, ДопПараметры.СтароеЗначение);
	Сформировать(Неопределено);

КонецПроцедуры

&НаСервере
Процедура ПослеСдвигаЗамераТаблицаНаСервере(НовоеЗначение, СтароеЗначение)
	
	Для Каждого ЭлементМассива Из СтароеЗначение.МассивДокументов Цикл
	    ЛидСсылка = ЭлементМассива.Регистратор; 
		Если ТипЗнч(ЛидСсылка) <> Тип("ДокументСсылка.Лид") Тогда
			Продолжить;
		КонецЕсли;
		НовоеЗначение.ВремяОкончанияЗамера = Мин(ОбщийМодульКлиентСервер.СоединитьДатуИВремя(НовоеЗначение.ДатаЗамера, ВремяКонцаЗамеров),
											НовоеЗначение.ВремяНачалаЗамера + (ЭлементМассива.ВремяОкончания - ЭлементМассива.ВремяНачала));
		//Если НЕ ЭлементМассива.ЭтоВыезд Тогда
			//пытаемся изменить документ лид
			ОбновитьЛидНаСервере(ЛидСсылка, 
							НовоеЗначение.ИсполнительЗамера,
							НовоеЗначение.ДатаЗамера,
							НовоеЗначение.ВремяНачалаЗамера,
							НовоеЗначение.ВремяОкончанияЗамера, ЭлементМассива.ЭтоВыезд, ЭлементМассива.ИДЗамера);
		//Иначе
							
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаявкуНаЗамер(Команда)
	
	ТекОбласть = Элементы.РезультатТаблица.ТекущаяОбласть;
	Расшифровка = Элементы.РезультатТаблица.ТекущаяОбласть.Расшифровка;
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекОбласть.Верх <= ТекОбласть.Низ Тогда
		Расшифровка.ВремяОкончанияЗамера = Мин(ВремяКонцаЗамеров,
											Расшифровка.ВремяНачалаЗамера + (ТекОбласть.Низ - ТекОбласть.Верх + 1) * (ПродолжительностьЗамера) * 3600);
	КонецЕсли;
										
	ОткрытьФормуНовогоЛида(Расшифровка);

		//Список = Новый СписокЗначений;
		//Список.ЗагрузитьЗначения(ПолучитьМассивИнтерваловЗамеров());
		//Для каждого элементСписка из Список Цикл
		//	ЭлементСписка.Представление = Формат(ЭлементСписка.Значение, "ДФ = ""ЧЧ:мм""");
		//КонецЦикла;
		//
		//ДополнительныеПараметры =  Новый Структура("ДатаЗамера, ИсполнительЗамера", Расшифровка.ДатаЗамера, Расшифровка.ИсполнительЗамера);
		//ОписаниеОповещенияВыборВремени = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтотОбъект, ДополнительныеПараметры);
		//ПоказатьВыборИзСписка(ОписаниеОповещенияВыборВремени, Список);
	//КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ВыполнитьПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПараметрыОснования = Новый Структура("ДатаЗамера, ВремяНачалаЗамера, ВремяОкончанияЗамера, ИсполнительЗамера");
//	ЗаполнитьЗначенияСвойств(ПараметрыОснования, ДополнительныеПараметры);
//	ПараметрыОснования.ВремяНачалаЗамера = Результат.Значение;
//	ПараметрыОснования.ВремяОкончанияЗамера = ПараметрыОснования.ВремяНачалаЗамера + 3600 * ПродолжительностьЗамера;
// 	ОткрытьФормуНовогоЛида(ПараметрыОснования);
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьМассивИнтерваловЗамеров()
//	Возврат МодульОтчетов.ПолучитьМассивИнтерваловЗамеров();
//КонецФункции

#КонецОбласти

#Область ОписаниеЗамерщиков

&НаСервере
Процедура СформироватьОписанияЗамерщиковHTML()
	ОписаниеЗамерщиковHTML = Документы.Лид.СформироватьОписаниеЗамерщиковHTML(ФильтрТочкаПродаж);
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЗамерщиковHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВРег(ДанныеСобытия.Element.tagName) = "A" Тогда
		
		СсылкаТекст = Сред(ДанныеСобытия.Element.href, 4);
		СсылкаЗамерщик = ЗамерщикПоВнутреннемуПредставлению(СсылкаТекст);
		Если НЕ СсылкаЗамерщик.Пустая()  Тогда 
			ПоказатьЗначение(, СсылкаЗамерщик);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗамерщикПоВнутреннемуПредставлению(СсылкаТекст) 
	Возврат ЗначениеИзСтрокиВнутр(СсылкаТекст);
КонецФункции

&НаКлиенте
Процедура ПоказатьОписаниеЗамерщиковНажатие(Элемент)
	
	Если Элементы.ГруппаОписаниеЗамерщиков.Видимость Тогда
		Элементы.ГруппаОписаниеЗамерщиков.Видимость = Ложь;
		Элементы.ПоказатьОписаниеЗамерщиков.Заголовок = "Показать описание замерщиков";
	Иначе
		Элементы.ГруппаОписаниеЗамерщиков.Видимость = Истина;
		Элементы.ПоказатьОписаниеЗамерщиков.Заголовок = "Скрыть описание замерщиков";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Отчет);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Отчет, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Отчет);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
